app/views/events/new.html.erb

    <%=f.label :category%>
    <%=f.collection_select :category_id, Category.all, :id, :name%><br>
---
SELECT "categories".* FROM "categories"