app/controllers/admins_controller.rb

    def create
        admin = Admin.create(admin_params)
---
INSERT INTO "admins" ("adminname", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)