app/controllers/admins_sessions_controller.rb

    def create
        admin = Admin.find_by(adminname:params[:admin][:adminname])
---
SELECT "admins".* FROM "admins" WHERE "admins"."adminname" = ? LIMIT ?  [["adminname", "admin"], ["LIMIT", 1]]