app/controllers/application_controller.rb

    def current_host
        @host = Host.find_by(id:session[:host_id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]