app/controllers/application_controller.rb

    def current_user
        @user = User.find_by(id:session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def current_host
        @host = Host.find_by(id:session[:host_id])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def current_admin
        @admin = Admin.find_by(id:session[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]