app/controllers/bookings_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @booking = Booking.new
        @event = Event.find(params[:id])

INSERT INTO "bookings" ("event_id", "user_id", "created_at", "updated_at", "ticket") VALUES (?, ?, ?, ?, ?)  [["event_id", 1], ["user_id", 1], ["created_at", "2019-12-31 09:24:33.183801"], ["updated_at", "2019-12-31 09:24:33.183801"], ["ticket", 3]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "places" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["places", 2], ["updated_at", "2019-12-31 09:24:33.208946"], ["id", 1]]
---
    def create

        booking = Booking.create(booking_params)
        booking.user = current_user
        booking.save
        @event = Event.find(params[:booking][:event_id])
        @event.places -= booking.ticket
        @event.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "places" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["places", 5], ["updated_at", "2019-12-31 09:24:44.198424"], ["id", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]
---
    def destroy
        @booking = Booking.find(params[:id])
        @event = @booking.event
        @event.places += @booking.ticket
        @event.save
        @booking.destroy