app/controllers/events_controller.rb

    def create
        @event = Event.create(event_params)
        @event.host = current_host
        @event.save
---
INSERT INTO "events" ("price", "date", "title", "description", "category_id", "host_id", "created_at", "updated_at", "time", "places") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)