app/controllers/hosts_controller.rb

INSERT INTO "hosts" ("hostname", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["hostname", "Tom"], ["password_digest", "$2a$10$JjhylunRaxlABkHlFZmyhuE.jr5Y3Th7wVMvSQUk3AvVRrS30k4k6"], ["created_at", "2019-12-31 08:52:22.758577"], ["updated_at", "2019-12-31 08:52:22.758577"]]
---
    def create

        host = Host.create(host_params)