app/controllers/hosts_sessions_controller.rb

    def create
        host = Host.find_by(hostname:params[:host][:hostname])
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."hostname" = ? LIMIT ?  [["hostname", "Tom"], ["LIMIT", 1]]