app/controllers/users_sessions_controller.rb

    def create
        user = User.find_by(username:params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "John"], ["LIMIT", 1]]