app/models/event.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "events" WHERE "events"."category_id" = ?  [["category_id", 1]]
SELECT "events".* FROM "events"
---
    def self.most_popular_category
       Category.all.max_by{|category| category.events.count}.name