app/models/host.rb

SELECT COUNT(*) FROM "bookings"
SELECT "bookings".* FROM "bookings"
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def self.most_popular_host
        if Booking.all.count >0
        hash = {}
        Booking.all.map{|booking|booking.event_id}.uniq.each{|item|hash[item]=0}
        Booking.all.each{|booking|
            hash[booking.event_id] += booking.ticket
        }
        result = hash.max_by{|k,v|v}
        Event.find(result[0]).host.hostname

SELECT "events".* FROM "events" WHERE "events"."host_id" = ?  [["host_id", 1]]
SELECT "hosts".* FROM "hosts"
---
    def self.inactive_hosts
        result =   Host.all.filter{|host|host.events == []}