app/models/user.rb

    def self.inactive_users
        result =   User.all.filter{|user|user.bookings == []}
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"